vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MIMXRT1043_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MIMXRT1043</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="20.0.0" date="2025-01-13">NXP CMSIS Packs based on MCUXpresso SDK 24.12.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MIMXRT1043" Dvendor="NXP:11">
      <description/>
      <device Dname="MIMXRT1043xxxxB">
        <processor Dcore="Cortex-M7" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="600000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_ram.icf"/>
        </environment>
        <sequences>
          <sequence name="ResetCatchSet">
            <block>
              // System Control Space (SCS) offset as defined
              // in Armv6-M/Armv7-M. Reimplement this sequence
              // if the SCS is located at a different offset.
              __var SCS_Addr   = 0xE000E000;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              // Device Specific
              __var bootmode   = 0;
              __var bootdevice = 0;
              __var vectable   = 0;
              __var imageentry = 0;
              __var useDEMCR   = 1;
              
              // Read Boot Mode
              bootmode   = (Read32(0x400F801C) &amp; 0x03000000) &gt;&gt; 24;  // SBMR2: Bit 25..24: BOOT_MODE[1:0]: 00b - Boot From Fuses, 01b - Serial Downloader, 10b - Internal Boot, 11b - Reserved
              // Read Boot Device
              bootdevice = (Read32(0x400F8004) &amp; 0x000000F0) &gt;&gt;  4;  // SBMR1: Bit   7..4:
              // Boot Device: 0000b - Serial NOR boot via FlexSPI
              //              01xxb - SD boot via uSDHC
              //              10xxb - eMMC/MMC boot via uSDHC
              //              001xb - SLC NAND boot via SEMC
              //              0001b - Parallel NOR boot via SEMC
              //              11xxb - Serial NAND boot via FlexSPI
            </block>
            <control if="bootmode == 0x2" info="Internal Boot Mode">
              <control if="bootdevice == 0" info="Serial NOR boot via FlexSPI">
                <block>
                  // Disable Reset Vector Catch in DEMCR
                  value = Read32(DEMCR_Addr);
                  Write32(DEMCR_Addr, (value &amp; (~0x00000001)));
                  
                  // Read user Image Vector Table address
                  vectable = Read32(0x60001004);
                  
                  // Read user image entry point and clear Thumb bit
                  imageentry = Read32(vectable + 4) &amp; (~0x00000001);
                </block>
                <control if="(vectable != 0xFFFFFFFF) &amp;&amp; (imageentry != 0xFFFFFFFF)">
                  <block>
                    // Program FPB Comparator 0 to user image entry point
                    Write32(0xE0002008, (imageentry | 1));
                    
                    // Enable FPB (FPB_CTRL = FPB_KEY|FPB_ENABLE)
                    Write32(0xE0002000, 0x00000003);
                    
                    // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
                    Read32(DHCSR_Addr);
                    
                    // Skip DEMCR.VC_CORERESET usage
                    useDEMCR = 0;
                  </block>
                </control>
              </control>
            </control>
            <control if="useDEMCR" info="Normal Reset Vector Catch">
              <block>
                // Enable Reset Vector Catch in DEMCR
                value = Read32(DEMCR_Addr);
                Write32(DEMCR_Addr, (value | 0x00000001));
                // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
                Read32(DHCSR_Addr);
              </block>
            </control>
          </sequence>
          <sequence name="ResetCatchClear">
            <block>
              // System Control Space (SCS) offset as defined
              // in ARMv6-M/ARMv7-M. Reimplement this sequence
              // if the SCS is located at a different offset.
              __var SCS_Addr   = 0xE000E000;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              
              // Disable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));
              
              //Clear BP0 and FPB
              Write32(0xE0002008, 0);                         // Clear BP0
              Write32(0xE0002000, 0x00000002);                // Disable FPB
            </block>
          </sequence>
          <sequence name="ResetSystem">
            <block>
              // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              
              __errorcontrol = 0x1;     // Skip errors, write to AIRCR.SYSRESETREQ may not be able to finish with OK response
              
              // Execute SYSRESETREQ via AIRCR
              Write32(AIRCR_Addr, 0x05FA0004);
              
