vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
              __errorcontrol = 0x0;     // Honor errors again
              
              DAP_Delay(20000);         // Delay of 20ms to let reset finish. Otherwise access to DHCSR can fail with too fast debug units.
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          </sequence>
        </sequences>
        <memory name="ROMCP" start="0x00200000" size="0x020000" access="rx" default="1"/>
        <memory name="SRAM_DTC" start="0x20000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_ITC" start="0x00000000" size="0x020000" access="rw" default="1"/>
        <memory name="SRAM_OC" start="0x20280000" size="0x040000" access="rw" default="1"/>
        <memory name="SRAM_OC2" start="0x20200000" size="0x080000" access="rw" default="1"/>
        <algorithm name="devices/MIMXRT1043/arm/MIMXRT104x_QSPI_4KB_SEC.FLM" start="0x60000000" size="0x00800000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <algorithm name="devices/MIMXRT1043/arm/MIMXRT104x_16MB_QSPI_4KB_SEC.FLM" start="0x60000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0x00008000" default="1"/>
        <debug svd="devices/MIMXRT1043/MIMXRT1043.xml"/>
        <variant Dvariant="MIMXRT1043DFP6B">
          <compile header="devices/MIMXRT1043/fsl_device_registers.h" define="CPU_MIMXRT1043DFP6B"/>
        </variant>
        <variant Dvariant="MIMXRT1043XFP5B">
          <compile header="devices/MIMXRT1043/fsl_device_registers.h" define="CPU_MIMXRT1043XFP5B"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MIMXRT1043.internal_condition">
      <accept Dname="MIMXRT1043DFP6B" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1043XFP5B" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.device=MIMXRT1043.internal_condition">
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.sai_edma, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_edma, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, device=MIMXRT1043.internal_condition">
      <require condition="anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition">
      <accept condition="allOf.component.igpio_adapter, driver.igpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.igpio_adapter, driver.igpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="igpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.exception_handling_cm7.condition_id">
      <require condition="allOf.utility.assert, utility.debug_console, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.utility.assert, utility.debug_console, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1043.internal_condition">
      <require condition="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <accept condition="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
    </condition>
