vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.romapi, device=MIMXRT1043.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.nvm_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyar8031.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phydp8384x.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phygpy215.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyksz8041.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyksz8081.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phylan8720a.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phylan8741.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8201.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8211f.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phytja1100.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phytja1120.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyvsc8541.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.phyyt8521.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.driver.pit, device=MIMXRT1043.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.pit_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT1043.internal_condition">
      <require condition="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition"/>
      <require condition="device.MIMXRT1043.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition">
      <accept condition="allOf.component.trng_adapter, driver.trng.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="allOf.component.trng_adapter, driver.trng.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1043.internal_condition"/>
    </condition>
