vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx8" Cversion="2.0.0" condition="component.silicon_id_imx8.condition_id">
      <description>Driver silicon_id imx8</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx8/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_imx93" Cversion="2.0.0" condition="component.silicon_id_imx93.condition_id">
      <description>Driver silicon_id imx93</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imx93/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt10xx" Cversion="2.0.0" condition="component.silicon_id_imxrt10xx.condition_id">
      <description>Driver silicon_id rt10xx</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rt10xx/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1170" Cversion="2.0.0" condition="component.silicon_id_imxrt1170.condition_id">
      <description>Driver silicon_id imxrt1170</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1170/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rt1180" Cversion="2.0.0" condition="component.silicon_id_imxrt1180.condition_id">
      <description>Driver silicon_id imxrt1180</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/imxrt1180/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxe31x" Cversion="2.0.0" condition="component.silicon_id_mcxe31x.condition_id">
      <description>Driver silicon_id mcxe31x</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxe31x/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxn" Cversion="2.0.0" condition="component.silicon_id_mcxn.condition_id">
      <description>Driver silicon_id mcxn</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/mcxn/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rw610" Cversion="2.0.0" condition="component.silicon_id_rw610.condition_id">
      <description>Driver silicon_id rw610</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/rw610/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_scfw" Cversion="2.0.0" condition="component.silicon_id_scfw.condition_id">
      <description>Driver silicon_id scfw</description>
      <files>
        <file category="sourceC" name="components/silicon_id/socs/scfw/fsl_silicon_id_soc.c" projectpath="component/silicon_id"/>
        <file category="header" name="components/silicon_id/socs/fsl_silicon_id_soc.h" projectpath="component"/>
        <file category="include" name="components/silicon_id/socs/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter" Cversion="2.2.0" condition="component.tfa9896_adapter.condition_id">
      <description>Component tfa9896 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.h" projectpath="codec/port/tfa9896"/>
        <file category="sourceC" name="components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.c" projectpath="codec/port/tfa9896"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9896/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter" Cversion="2.2.0" condition="component.tfa9xxx_adapter.condition_id">
      <description>Component tfa9xxx adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.h" projectpath="codec/port/tfa9xxx"/>
        <file category="sourceC" name="components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.c" projectpath="codec/port/tfa9xxx"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/tfa9xxx/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
