vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1043_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1043_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/arm/MIMXRT1043xxxxx_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1043/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/arm/MIMXRT1043xxxxx_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1043/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/arm/MIMXRT1043xxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT1043/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/arm/MIMXRT1043xxxxx_sdram.scf" version="1.0.0" projectpath="MIMXRT1043/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/arm/MIMXRT1043xxxxx_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1043/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/gcc/MIMXRT1043xxxxx_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1043/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/gcc/MIMXRT1043xxxxx_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1043/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/gcc/MIMXRT1043xxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT1043/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/gcc/MIMXRT1043xxxxx_sdram.ld" version="1.0.0" projectpath="MIMXRT1043/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/gcc/MIMXRT1043xxxxx_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1043/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1043/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1043/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT1043/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_sdram.icf" version="1.0.0" projectpath="MIMXRT1043/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MIMXRT1043xxxxB.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1043/iar/MIMXRT1043xxxxx_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1043/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1043" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1043</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1043/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1043/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1043/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1043/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1043/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1043/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1043/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1043/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1043/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1043_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1043/iar/startup_MIMXRT1043.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1043/gcc/startup_MIMXRT1043.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1043/arm/startup_MIMXRT1043.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1043_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1043_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/system_MIMXRT1043.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1043/system_MIMXRT1043.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1043/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_12b1msps_sar" Cversion="2.0.4" condition="driver.adc_12b1msps_sar.condition_id">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_adc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_adc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.3.2" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
