vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1043_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pxp" Cversion="2.7.0" condition="driver.pxp.condition_id">
      <description>PXP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_pxp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_pxp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.3.0" condition="driver.qtmr_1.condition_id">
      <description>QTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_qtmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_qtmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.0.2" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_romapi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.4" condition="driver.rtwdog.condition_id">
      <description>RTWDOG Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_rtwdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_rtwdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.3" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="semc" Cversion="2.7.1" condition="driver.semc.condition_id">
      <description>SEMC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1043/drivers/fsl_semc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1043/drivers/fsl_semc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1043/drivers/"/>
      </files>
    </component>
